x86_nvme/multhread/iscsi_libaio_1024_randwrite_512k.log
iscsi_libaio_1024_randwrite_512k: (g=0): rw=randwrite, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=1024
...
fio-3.1
Starting 24 processes

iscsi_libaio_1024_randwrite_512k: (groupid=0, jobs=24): err= 0: pid=30347: Tue Sep  8 00:34:18 2020
  write: IOPS=2221, BW=1111MiB/s (1164MB/s)(652GiB/601371msec)
    slat (usec): min=29, max=210872, avg=10776.67, stdev=13902.67
    clat (msec): min=869, max=27272, avg=10988.06, stdev=5468.22
     lat (msec): min=879, max=27307, avg=10998.84, stdev=5473.03
    clat percentiles (msec):
     |  1.00th=[ 3373],  5.00th=[ 4597], 10.00th=[ 5000], 20.00th=[ 5873],
     | 30.00th=[ 6611], 40.00th=[ 7819], 50.00th=[ 9731], 60.00th=[12013],
     | 70.00th=[13758], 80.00th=[16442], 90.00th=[17113], 95.00th=[17113],
     | 99.00th=[17113], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=  708, max=578560, per=4.17%, avg=47364.77, stdev=32694.12, samples=28409
   iops        : min=    1, max= 1130, avg=92.29, stdev=63.84, samples=28409
  lat (msec)   : 1000=0.01%, 2000=0.29%, >=2000=99.70%
  cpu          : usr=0.55%, sys=0.63%, ctx=650079, majf=0, minf=2759177
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,1335662,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1024

Run status group 0 (all jobs):
  WRITE: bw=1111MiB/s (1164MB/s), 1111MiB/s-1111MiB/s (1164MB/s-1164MB/s), io=652GiB (700GB), run=601371-601371msec

Disk stats (read/write):
  nvme0n1: ios=45/5340099, merge=0/0, ticks=4/18446744072863092316, in_queue=18446744072920288728, util=100.00%